## Load Data

In [3]:
import pandas as pd

In [24]:
survey_df = pd.read_csv("survey_results_public.csv")

In [7]:
#df.columns
#df.info()

In [31]:
people = {"first":["Corey","Jane","John"],
          "last":["Schafer","Doe","Doe"],
          "email":["coreys@gmail.com","janed@gmail.com","johnd@gmail.com"]}

In [32]:
df = pd.DataFrame(people)

In [13]:
df.head()

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [17]:
print(type(df['email']))
print(type(df.email)) #series - single column

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [18]:
df[['last','email']] #select some columns only (>=2 cols is df)

      last             email
0  Schafer  coreys@gmail.com
1      Doe   janed@gmail.com
2      Doe   johnd@gmail.com

## Selecting Rows and Cols

#### iloc (slicing based on num)

In [20]:
df.iloc[0] #get the first row (return a series contains the first row of data)

first               Corey
last              Schafer
email    coreys@gmail.com
Name: 0, dtype: object

In [21]:
df.iloc[[0,1],2] #first 2 rows then get only the 3rd col

0    coreys@gmail.com
1     janed@gmail.com
Name: email, dtype: object

#### loc (slicing based on index name and column name)

In [23]:
df.loc[[0,1],'email']

0    coreys@gmail.com
1     janed@gmail.com
Name: email, dtype: object

In [ ]:
df.loc[[0,1],'email']

#### Practice

In [40]:
#survey_df.columns

In [28]:
#grab the values from the age col and count the categories
survey_df.Age.value_counts()

25-34 years old       33247
35-44 years old       20532
18-24 years old       17931
45-54 years old        8334
Under 18 years old     4128
55-64 years old        3392
65 years or older      1171
Prefer not to say       449
Name: Age, dtype: int64

In [33]:
#get first 3 rows for age col
survey_df.loc[:2,['Age']]

               Age
0  18-24 years old
1  25-34 years old
2  45-54 years old

In [39]:
survey_df.loc[:2,'Age':'EdLevel'] #first 3 rows and Age to Edlevel columns

,Age,Employment,RemoteWork,CodingActivities,EdLevel
0,18-24 years old,NaN,NaN,NaN,NaN
1,25-34 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)"
2,45-54 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Professional development or self-paced l...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)"

## Indexing

In [48]:
df

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [49]:
df.set_index('email',inplace = True)

In [50]:
df

                  first     last
email
coreys@gmail.com  Corey  Schafer
janed@gmail.com    Jane      Doe
johnd@gmail.com    John      Doe

In [51]:
df.loc['coreys@gmail.com']

first      Corey
last     Schafer
Name: coreys@gmail.com, dtype: object

In [52]:
df.loc['coreys@gmail.com','last']

'Schafer'

In [53]:
#reset index back to original without reloading df
df.reset_index(inplace = True)
df

              email  first     last
0  coreys@gmail.com  Corey  Schafer
1   janed@gmail.com   Jane      Doe
2   johnd@gmail.com   John      Doe

In [61]:
schema_df = pd.read_csv('survey_results_schema.csv')
schema_df.head(3)

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB
1,QID12,MetaInfo,Browser Meta Info,False,Meta,Browser
2,QID310,Q310,"<div><span style=""font-size:19px;""><strong>You...",False,DB,TB

In [62]:
#read dataframe and set index at the same time 
schema_df = pd.read_csv('survey_results_schema.csv',index_col = 'qname')

In [65]:
schema_df.loc['Country']

qid                                                        QID6
question      Where do you live? <span style="font-weight: b...
force_resp                                                 True
type                                                         MC
selector                                                     DL
Name: Country, dtype: object

In [66]:
schema_df.loc['Country','question']

'Where do you live? <span style="font-weight: bolder;">*</span>'

In [70]:
#sort by index
schema_df.sort_index(ascending=True, inplace = True) #remember to set inplace = True or else won't replace
schema_df.head(5)

,qid,question,force_resp,type,selector
qname,,,,,
AIAcc,QID324,For the AI tools you use as part of your devel...,False,MC,MAVR
AIBen,QID316,How much do you trust the accuracy of the outp...,False,MC,SAVR
AIDev,QID328,Which <b>AI-powered developer tools</b> did yo...,False,Matrix,Likert
AINext,QID320,Thinking about how your workflow and process c...,False,Matrix,Likert
AIOpen,QID321,Please describe how you would expect your work...,False,TE,SL

## Filtering

#### loc and filter usage

In [73]:
df

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [75]:
filt = (df['last']=='Doe')

In [76]:
df[filt] #or df[df['last']=='Doe']

  first last            email
1  Jane  Doe  janed@gmail.com
2  John  Doe  johnd@gmail.com

In [77]:
df.loc[filt] #loc can also filter based on a boolean filter condition

  first last            email
1  Jane  Doe  janed@gmail.com
2  John  Doe  johnd@gmail.com

In [78]:
df.loc[filt,'email']

1    janed@gmail.com
2    johnd@gmail.com
Name: email, dtype: object

### AND Filter & OR Filter

In [86]:
#AND Filter
filt = (df['last']=='Doe') & (df['first'] == 'John')
df[filt]

  first last            email
2  John  Doe  johnd@gmail.com

In [87]:
#OR Filter
filt = (df['last']=='Doe') | (df['first'] == 'John')
df[filt]

  first last            email
1  Jane  Doe  janed@gmail.com
2  John  Doe  johnd@gmail.com

#### isin() filter to only select values from a list

In [90]:
name_list = ['Jane','John']
filt = df['first'].isin(name_list)

In [91]:
df[filt]

  first last            email
1  Jane  Doe  janed@gmail.com
2  John  Doe  johnd@gmail.com

## Update Rows and Cols

#### Rename Column Names

In [101]:
df.columns = [x.upper() for x in df.columns]

In [102]:
df

   FIRST     LAST             EMAIL
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [104]:
df.columns = [x.lower() for x in df.columns]
df

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [106]:
#Replace a specific column name
df.rename(columns={'first':'first_name'},inplace = True)
df

  first_name     last             email
0      Corey  Schafer  coreys@gmail.com
1       Jane      Doe   janed@gmail.com
2       John      Doe   johnd@gmail.com

#### Change single and multiple values

In [107]:
df.loc[2,'last'] = 'hahaha'
df

  first_name     last             email
0      Corey  Schafer  coreys@gmail.com
1       Jane      Doe   janed@gmail.com
2       John   hahaha   johnd@gmail.com

In [108]:
df.loc[2,['last','email']] = ['keke','johnkeke@gmail.com']
df

  first_name     last               email
0      Corey  Schafer    coreys@gmail.com
1       Jane      Doe     janed@gmail.com
2       John     keke  johnkeke@gmail.com

#### Apply a function

In [12]:
#apply - apply a function to each value in the serie
df['email'].apply(len)

0    23
1    22
2    22
Name: email, dtype: int64

In [13]:
def update_email(email):
    return email.upper() + ' update'

In [14]:
df['email'] = df['email'].apply(update_email)

In [15]:
df

   first     last                           email
0  Corey  Schafer  COREYS@GMAIL.COM UPDATE update
1   Jane      Doe   JANED@GMAIL.COM UPDATE update
2   John      Doe   JOHND@GMAIL.COM UPDATE update

In [17]:
#Apply lambda function
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last                           email
0  Corey  Schafer  coreys@gmail.com update update
1   Jane      Doe   janed@gmail.com update update
2   John      Doe   johnd@gmail.com update update

#### Map and Replace

In [ ]:
df['first'].map({'Jane':'Yes'})

0    NaN
1    Yes
2    NaN
Name: first, dtype: object

In [29]:
df['first'].replace({'Jane':'Yes'})

0    Corey
1      Yes
2     John
Name: first, dtype: object

#### Apply and make change on the whole df

In [21]:
df.min() #apply this function across all columns, you can also do row by specifying ="rows"
#Same as 
df.apply(lambda x: x.min())

first                             Corey
last                                Doe
email    coreys@gmail.com update update
dtype: object

In [23]:
#If you want to apply a function to all values in a df, you need to use applymap
#apply will only apply that on 
df.applymap(len)

   first  last  email
0      5     7     30
1      4     3     29
2      4     3     29

In [24]:
df.applymap(str.lower)

   first     last                           email
0  corey  schafer  coreys@gmail.com update update
1   jane      doe   janed@gmail.com update update
2   john      doe   johnd@gmail.com update update

## Add/Remove Rows and Columns

In [34]:
df['full_name'] = df['first'] + ' ' + df['last'] #can't use df.full_name, python will think you're changing attribute instead of series

In [35]:
df

   first     last             email      full_name
0  Corey  Schafer  coreys@gmail.com  Corey Schafer
1   Jane      Doe   janed@gmail.com       Jane Doe
2   John      Doe   johnd@gmail.com       John Doe

In [36]:
#Drop columns
df.drop(columns=['first','last']) #remember to put inplace = True to actually change

              email      full_name
0  coreys@gmail.com  Corey Schafer
1   janed@gmail.com       Jane Doe
2   johnd@gmail.com       John Doe

In [37]:
#drop row with a index
df.drop(index=0)

  first last            email full_name
1  Jane  Doe  janed@gmail.com  Jane Doe
2  John  Doe  johnd@gmail.com  John Doe

In [ ]:
#drop rows with filter
df.drop(index=df[df['last'] == 'Doe'].index)

## Sorting Data

In [48]:
people = {"first":["Corey","Jane","John","Adam"],
          "last":["Schafer","Doe","Doe","Doe"],
          "email":["coreys@gmail.com","janed@gmail.com","johnd@gmail.com","adoe@gmail.com"]}

In [49]:
df = pd.DataFrame(people)

In [50]:
df.sort_values(by='last',ascending=True)

   first     last             email
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com
3   Adam      Doe    adoe@gmail.com
0  Corey  Schafer  coreys@gmail.com

In [52]:
df.sort_values(by=['last','first'],ascending=False)

   first     last             email
0  Corey  Schafer  coreys@gmail.com
2   John      Doe   johnd@gmail.com
1   Jane      Doe   janed@gmail.com
3   Adam      Doe    adoe@gmail.com

In [55]:
#sort by multiple col each with different orders
df.sort_values(by=['last','first'],ascending=[False,True])

   first     last             email
0  Corey  Schafer  coreys@gmail.com
3   Adam      Doe    adoe@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [56]:
#sort index
df.sort_index()

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com
3   Adam      Doe    adoe@gmail.com

In [57]:
 survey_df = pd.read_csv('survey_results_public.csv')

In [58]:
survey_df.sort_values(by=['Country','ConvertedComp'],ascending=[True,False],inplace=True)

In [60]:
survey_df[['Country','ConvertedComp']].head(5)

           Country  ConvertedComp
61540  Afghanistan      1000000.0
63925  Afghanistan      1000000.0
63993  Afghanistan      1000000.0
38261  Afghanistan       231192.0
28270  Afghanistan       130000.0

In [63]:
#Get the top N in a series without sorting
survey_df['ConvertedComp'].nlargest(5)

5701     2000000.0
53175    2000000.0
42657    2000000.0
58136    2000000.0
45753    2000000.0
Name: ConvertedComp, dtype: float64

In [65]:
#Get the top N records including all columns based on a column. Same as gettinng head(3) after sorting
survey_df.nlargest(3,'ConvertedComp')

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
5701,5725,I am a developer by profession,No,26.0,14,Monthly,180000.0,2000000.0,Canada,United States dollar,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Gatsby,Spring,Not applicable - I did not use Stack Overflow ...,40.0,10,4
53175,54263,I am a developer by profession,Yes,29.0,10,Weekly,70000.0,2000000.0,Canada,United States dollar,...,Neither easy nor difficult,Too long,No,"Computer science, computer engineering, or sof...",React.js;Vue.js,Express;Flask;jQuery,Just as welcome now as I felt last year,36.0,14,5
42657,43430,I am a developer by profession,Yes,33.0,17,Monthly,171000.0,2000000.0,Italy,United States dollar,...,Easy,Appropriate in length,No,"Computer science, computer engineering, or sof...",NaN,NaN,Just as welcome now as I felt last year,40.0,13,2

## Grouping and Aggregating Data

#### Aggregation Method and Value Count

In [73]:
#calculate agg on series
print(survey_df['ConvertedComp'].median())
print(survey_df['ConvertedComp'].mean())
print(survey_df['ConvertedComp'].describe())

54049.0
103756.05014961446
count    3.475600e+04
mean     1.037561e+05
std      2.268853e+05
min      0.000000e+00
25%      2.464800e+04
50%      5.404900e+04
75%      9.500000e+04
max      2.000000e+06
Name: ConvertedComp, dtype: float64

In [72]:
survey_df.describe()

         Respondent           Age      CompTotal  ConvertedComp   WorkWeekHrs
count  64461.000000  45446.000000   3.482600e+04   3.475600e+04  41151.000000
mean   32554.079738     30.834111  3.190464e+242   1.037561e+05     40.782174
std    18967.442360      9.585392            inf   2.268853e+05     17.816383
min        1.000000      1.000000   0.000000e+00   0.000000e+00      1.000000
25%    16116.000000     24.000000   2.000000e+04   2.464800e+04     40.000000
50%    32231.000000     29.000000   6.300000e+04   5.404900e+04     40.000000
75%    49142.000000     35.000000   1.250000e+05   9.500000e+04     44.000000
max    65639.000000    279.000000  1.111111e+247   2.000000e+06    475.000000

In [76]:
#count value under each category
survey_df['Hobbyist'].value_counts()

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [118]:
#survey_df.columns

In [92]:
survey_df['CompFreq'].value_counts()

Yearly     19818
Monthly    18899
Weekly      1352
Name: CompFreq, dtype: int64

In [95]:
#count value but into percentage with normalize = True
survey_df['CompFreq'].value_counts(normalize=True)

Yearly     0.494597
Monthly    0.471661
Weekly     0.033742
Name: CompFreq, dtype: float64

#### Group By Operation

In [111]:
#group by operation
survey_df['Country'].value_counts()

United States       12469
India                8403
United Kingdom       3896
Germany              3890
Canada               2191
                    ...
Liechtenstein           1
Mali                    1
Marshall Islands        1
Nauru                   1
Lesotho                 1
Name: Country, Length: 183, dtype: int64

In [98]:
survey_df.groupby(['Country']) #group by object

In [108]:
country_grp = survey_df.groupby(['Country']) #group by 1 col
country_grp.get_group('Solomon Islands') #similar to getting a filter but it's pulling from the group by object

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
53388,54480,I am a student who is learning to code,No,31.0,20,NaN,NaN,NaN,Solomon Islands,NaN,...,Neither easy nor difficult,Appropriate in length,No,"Information systems, information technology, o...",Django;Drupal;jQuery;React.js;Ruby on Rails;Vu...,Django;Drupal;jQuery;React.js;Ruby on Rails;Vu...,A lot more welcome now than last year,NaN,11,NaN
56403,57526,I code primarily as a hobby,Yes,25.0,12,NaN,NaN,NaN,Solomon Islands,NaN,...,Neither easy nor difficult,Appropriate in length,No,NaN,NaN,NaN,Just as welcome now as I felt last year,NaN,Less than 1 year,NaN

In [110]:
country_grp['Age'].value_counts().loc['Solomon Islands']

Age
25.0    1
31.0    1
Name: Age, dtype: int64

In [112]:
country_grp['ConvertedComp'].median()

Country
Afghanistan                             15163.5
Albania                                 15900.0
Algeria                                  9432.0
Andorra                                 88640.0
Angola                                   5292.0
                                         ...
Venezuela, Bolivarian Republic of...     3600.0
Viet Nam                                10344.0
Yemen                                   36000.0
Zambia                                   5452.0
Zimbabwe                                 7200.0
Name: ConvertedComp, Length: 183, dtype: float64

In [148]:
country_grp['ConvertedComp'].median().reset_index() #Use reset index to show the group as a column

                                  Country  ConvertedComp
0                             Afghanistan        15163.5
1                                 Albania        15900.0
2                                 Algeria         9432.0
3                                 Andorra        88640.0
4                                  Angola         5292.0
..                                    ...            ...
178  Venezuela, Bolivarian Republic of...         3600.0
179                              Viet Nam        10344.0
180                                 Yemen        36000.0
181                                Zambia         5452.0
182                              Zimbabwe         7200.0

[183 rows x 2 columns]

In [151]:
#Create a Rank column based on the value, similar to row number in SQL:
sorted_df = country_grp['ConvertedComp'].median().reset_index().sort_values(['ConvertedComp'])
sorted_df['rank'] = sorted_df.reset_index().index+1
sorted_df

                  Country  ConvertedComp  rank
91                Lesotho           24.0     1
155                 Sudan         2526.0     2
24      Brunei Darussalam         2580.0     3
159  Syrian Arab Republic         2916.0     4
29               Cameroon         3532.0     5
..                    ...            ...   ...
139           Saint Lucia            NaN   179
145          Sierra Leone            NaN   180
149       Solomon Islands            NaN   181
161            Tajikistan            NaN   182
164           Timor-Leste            NaN   183

[183 rows x 3 columns]

In [ ]:
#Create rank but if the value is the same then use the same rank. Similar to rank() in SQL
df['rank'] = df['day'].rank(ascending=False).astype(int)

In [114]:
country_grp['ConvertedComp'].median().loc['China'] 
#looks like after performing a agg fn on a groupby object, 
#the index is the group by column itself like country here

35861.5

In [115]:
country_grp['ConvertedComp'].agg(['median','mean']) #pass in multiple agg function

                                       median           mean
Country
Afghanistan                           15163.5  148290.125000
Albania                               15900.0   25611.000000
Algeria                                9432.0   10362.812500
Andorra                               88640.0   88640.000000
Angola                                 5292.0    5292.000000
...                                       ...            ...
Venezuela, Bolivarian Republic of...   3600.0    6280.611111
Viet Nam                              10344.0   28342.605769
Yemen                                 36000.0   36000.000000
Zambia                                 5452.0   17506.400000
Zimbabwe                               7200.0   26338.181818

[183 rows x 2 columns]

In [130]:
#Practice: what % of people from each country known Python
survey_df['Python'] = survey_df['LanguageWorkedWith'].str.contains('Python',na=False)

In [132]:
survey_df[['Country','python']].head(3)

           Country python
61540  Afghanistan    NaN
63925  Afghanistan    NaN
63993  Afghanistan    NaN

In [134]:
survey_df.groupby(['Country'])['Python'].sum()/survey_df.groupby(['Country'])['Python'].count()

Country
Afghanistan                             0.130952
Albania                                 0.240741
Algeria                                 0.425532
Andorra                                 0.230769
Angola                                  0.111111
                                          ...
Venezuela, Bolivarian Republic of...    0.414286
Viet Nam                                0.280220
Yemen                                   0.142857
Zambia                                  0.190476
Zimbabwe                                0.419355
Name: Python, Length: 183, dtype: float64

## Join or stack dataframes

In [ ]:
#Left join example
joined_df = df1.merge(df2,
               left_on='uid_s', right_on='uid_s', how='left')

In [ ]:
#Stack two df on top of each other
c = pd.concat([a,b],ignore_index=True)

## Cleaning Data & Handling Missing Value

In [139]:
import pandas as pd
import numpy as np

In [140]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [141]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [142]:
#drop any null rows
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [146]:
#drop null rows if all columns in the subset have null
df.dropna(axis=0, how='all', subset=['last', 'email']) #should be same as using axis = 'index'

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [145]:
#drop null rows if any columns in the subset have null
df.dropna(axis='index', how='any', subset=['last', 'email']) #can also use axis = 0

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [ ]:
#Fill with mean
df.fillna(df.mean())

In [ ]:
#Convert data type of a column
df['age'].astype(float)

0    33.0
1    55.0
2    63.0
3    36.0
4     NaN
5     NaN
6     NaN
Name: age, dtype: float64